Revit 2027 API
BuiltInFailures.SketchFailures.AreaLoadNoForce Property
 Area Load can't have all force components equal to zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaLoadNoForce { get; }
Public Shared ReadOnly Property AreaLoadNoForce As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaLoadNoForce {
	FailureDefinitionId^ get ();
}
static member AreaLoadNoForce : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace